I made another test by creating custom FW service based on this, https://registry.terraform.io/providers/fortinetdev/fortios/latest/docs/resources/fortios_firewallservice_custom, and it fails as well

```
Terraform used the selected providers to generate the following execution plan. Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # fortios_firewallservice_custom.trname will be created
  + resource "fortios_firewallservice_custom" "trname" {
      + app_service_type      = "disable"
      + category              = "General"
      + check_reset_range     = "default"
      + color                 = 0
      + dynamic_sort_subtable = "false"
      + fabric_object         = (known after apply)
      + get_all_tables        = "false"
      + helper                = "auto"
      + id                    = (known after apply)
      + iprange               = "0.0.0.0"
      + name                  = "sservice_custom2"
      + protocol              = "TCP/UDP/SCTP"
      + protocol_number       = 6
      + proxy                 = "disable"
      + tcp_halfclose_timer   = 0
      + tcp_halfopen_timer    = 0
      + tcp_portrange         = "223-332"
      + tcp_timewait_timer    = 0
      + udp_idle_timer        = 0
      + uuid                  = (known after apply)
      + vdomparam             = (known after apply)
      + visibility            = "enable"
    }

Plan: 1 to add, 0 to change, 0 to destroy.

Do you want to perform these actions?
  Terraform will perform the actions described above.
  Only 'yes' will be accepted to approve.

  Enter a value: yes

fortios_firewallservice_custom.trname: Creating...
╷
│ Error: Error creating FirewallServiceCustom resource: Internal Server Error - Internal error when processing the request (500)
│ Cli response: 
│ []
│ 
│   with fortios_firewallservice_custom.trname,
│   on main.tf line 85, in resource "fortios_firewallservice_custom" "trname":
│   85: resource "fortios_firewallservice_custom" "trname" {
```

Could this be related to the FOS version being used, i.e. 7.6.0?